[
 {
   "Party": "Democratic",
   "Name": "Andy Beshar",
   "Candidate Description": "**Education and Public Schools**: The candidate believes in fully funding every public school and making sure every child has access to a quality education, regardless of zip code or family income.\n**Healthcare**: The candidate supports affordable healthcare and is fighting against a federal court ruling that would eliminate mandatory coverage for pre-existing conditions, which would affect 1.3 million Kentuckians. They also plan to halt Governor Bevin's effort to throw thousands of families off Medicaid.\n**Economy and Job Creation**: The candidate wants to create good-paying jobs that enable men and women to raise their families and will focus on investing in the workforce, agritech, automation, data analytics, and healthcare.\n**Pensions**: The candidate believes in keeping the promised pension benefits for public employees, including teachers, police officers, firefighters, and others.\n**Transparency and Corruption**: The candidate supports full transparency and has released their tax returns for three straight years. They plan to require statewide officeholders to release their tax returns, ban state contractors from giving gifts to public officials, and institute term limits for state legislators.\n**College Affordability**: The candidate has fought against unscrupulous for-profit colleges and secured debt relief for Kentucky students. As governor, they will work to lower the costs of attending Kentucky's public universities and community colleges.\n**Criminal Justice Reform**: The candidate plans to automatically restore voting rights for Kentuckians with felony convictions who have completed their sentences and will continue to work to root out bias and discrimination in the criminal justice system.\n**Diversity and Inclusiveness**: The candidate believes in having a diverse and inclusive government, with a cabinet that reflects the growing diversity of the state.\n**Energy and Environment**: The candidate supports an all-the-above energy policy, including renewables and clean-coal technology, and has opposed utility bill hikes, saving Kentucky families nearly $1.2 billion.\n**Equal Pay and Labor**: The candidate believes in eliminating the pay gap between men and women and will work to pass equal pay legislation. They also oppose Right-To-Work (for less) laws and will support a bill to repeal this law and reinstate the prevailing wage law.\n**Marriage Equality and Reproductive Rights**: The candidate supports marriage equality and the right to reproductive healthcare decisions. \n**Opioids and Substance Abuse**: The candidate has been aggressive in fighting opioid manufacturers and distributors in court and will continue to work to address the opioid epidemic as governor.\n**Voting Rights**: The candidate believes in protecting and expanding voting rights, including automatic restoration of voting rights for Kentuckians with a non-violent felony who have completed their sentences and implementing automatic voter registration and making it easier for voters to cast absentee ballots."
 },
 {
   "Party": "Democratic",
   "Name": "Pete Buttigieg",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Democratic",
   "Name": "Roy Cooper",
   "Candidate Description": "* Emphasis on job creation, education, and economic development\n* Commitment to improving teacher pay and funding\n* Strong leadership on issues of discrimination, healthcare, and environmental protection\n* Proven ability to lead the state through crisis and invest in recovery efforts"
 },
 {
   "Party": "Democratic",
   "Name": "Mark Kelly",
   "Candidate Description": "**Health Care**: Mark believes that health care is a right, and every Arizonan should have quality health care coverage. He supports a public health care option, lowering prescription drug costs, and more transparency in hospital costs.\n**Veterans**: Mark, a Navy combat veteran, will fight to ensure that America keeps its promises to Arizona veterans. He believes in accountability at the VA, quality health care, and support for mental health care and job opportunities.\n**Economy and Jobs**: Mark will be a champion for working Arizonans and the middle class. He supports ending tax breaks for the wealthy, investing in research and development, and making workforce development more accessible and affordable.\n**Medicare and Social Security**: Mark opposes legislation weakening Social Security and Medicare, and believes in protecting the health and wellbeing of seniors.\n**Border Security and Immigration**: Mark believes in a strong, secure border and fixing the broken immigration system. He supports border security, improving programs like E-Verify, and protecting DREAMers.\n**Education**: Mark supports public education, expanding access to quality early childhood education, increasing funding for teachers and schools, and ensuring all students have access to STEM classes and advanced placement classes.\n**National Security**: Mark, a Navy pilot, will work across the aisle to ensure national security and protect Arizona's military bases.\n**Women's Rights**: Mark supports policies that empower women, including reproductive health care, paid family leave, and equal pay.\n**Gun Safety**: Mark is a gun owner and advocate for commonsense gun laws, including universal background checks, keeping guns out of the hands of stalkers and domestic abusers, and reducing mass shootings and suicides.\n**Climate Change and Environment**: Mark believes that climate change poses a threat to Arizona's economy and way of life, and supports massive investments in research and development of renewable energy technologies."
 },
 {
   "Party": "Democratic",
   "Name": "Wes Moore",
   "Candidate Description": "* Economy: Moore prioritizes creating economic opportunities for all Marylanders, with a focus on increasing access to work, wages, and wealth for Black families.\n* Transportation: He supports a regional approach to transportation, prioritizing equity and opportunity in transportation planning, and implementing policies to drive economic growth at BWI Marshall Airport and the Port of Baltimore.\n* Education: Moore is committed to fully funding and implementing the Blueprint for Maryland's Future, supporting educators and families, and increasing access to early childhood education and job training programs.\n* Civil Rights and Social Justice: He advocates for equity and social justice, supporting policies to address systemic barriers and promote redemption and second chances for individuals with criminal records.\n* Healthcare: Moore prioritizes expanding access to healthcare, including behavioral health services, and reducing healthcare costs for Marylanders.\n* Climate: He supports setting aggressive clean energy and emissions reductions standards, prioritizing environmental justice, and investing in green infrastructure.\n* Public Safety: Moore is committed to combating gun violence, reforming the probation and parole system, and increasing resources for state law enforcement agencies.\n* Supporting Seniors: He prioritizes improving state and local services for seniors, addressing elder abuse and exploitation, and increasing access to affordable housing and healthcare.\n* Supporting Individuals with Disabilities: Moore supports creating an inclusive economy, improving access to education, employment, and economic wellbeing for individuals with disabilities, and increasing investments in supportive housing and transportation options."
 },
 {
   "Party": "Democratic",
   "Name": "Gavin Newsom",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Democratic",
   "Name": "J. B. Prtizker",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Democratic",
   "Name": "Gina Raimondo ",
   "Candidate Description": "1. Providing job training and education to every Rhode Islander to help them get a good job and compete in the economy.\n2. Building a stronger middle class through investments in economic development, job training, infrastructure, and education.\n3. Creating opportunities for all Rhode Islanders, particularly focusing on rebuilding the middle class."
 },
 {
   "Party": "Democratic",
   "Name": "Josh Shapiro",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Democratic",
   "Name": "Tim Walz",
   "Candidate Description": "**Economy**\n* Increase funding for education and infrastructure\n* Support small businesses and entrepreneurship\n* Ensure equitable access to opportunities for all\n**Education**\n* Increase funding for K-12 education and support for teachers\n* Make higher education more affordable and accessible\n* Support adult education and job training programs\n**Health Care**\n* Make health care more affordable and accessible\n* Support mental health care and substance abuse treatment\n* Protect the rights of women and LGBTQ+ individuals\n*Environment**\n* Expand renewable energy sources and reduce carbon emissions\n* Support sustainable agriculture and forestry practices\n* Address climate change and its impacts on Minnesota\n**Gun Violence Prevention**\n* Support universal background checks and ban assault weapons\n* Pass red flag laws and improve mental health care\n* Increase funding for gun violence research and prevention programs\n**Health and Human Services**\n* Increase funding for Medicaid and other healthcare programs\n* Support mental health care and substance abuse treatment\n* Address the opioid crisis and its impacts on Minnesota\n**Labor and Workers' Rights**\n* Increase the minimum wage and provide for paid family leave\n* Protect collective bargaining rights and support worker organizations\n* Support fair scheduling and wage theft laws\n* Protect the rights of workers to organize and bargain collectively\n**Public Safety**\n* Address systemic racism and police brutality\n* Support community-based policing and restorative justice\n* Increase funding for crime prevention and rehabilitation programs\n**Transportation**\n* Increase funding for transportation infrastructure and services\n* Improve road safety and reduce traffic congestion\n* Protect the rights of workers and commuters\n**Veterans**\n* Support veterans' homes and services for disabled veterans\n* Expand access to veterans' courts and provide for suicide prevention education\n* Increase funding for County Veterans Service Officers and Native American veterans"
 },
 {
   "Party": "Democratic",
   "Name": "Raphael Warnock",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Democratic",
   "Name": "Gretchen Whitmer",
   "Candidate Description": "**Fixing the Roads:** The candidate promises to fix Michigan's roads, which they say are in dire need of repair. They propose upgrading the state's infrastructure, including roads, bridges, and water systems.\n**Health Care:** The candidate vows to make health care more affordable and accessible for all Michiganders. They propose expanding Medicaid, protecting the Affordable Care Act, and lowering prescription drug costs.\n**Clean Water:** The candidate promises to clean up Michigan's drinking water, which they say is contaminated in many areas. They propose upgrading the state's water infrastructure and holding government accountable for ensuring safe drinking water.\n**Education:** The candidate promises to improve education in Michigan, including increasing funding for public schools, supporting early childhood education, and promoting vocational training.\n**Economic Development:** The candidate promises to create jobs and stimulate economic growth in Michigan by investing in infrastructure, supporting small businesses, and promoting entrepreneurship.\n**Repeal the Retirement Tax:** The candidate vows to repeal the retirement tax, which they say is unfair to seniors and retirees.\n**Women's Rights:** The candidate promises to protect and promote women's rights, including access to reproductive care, equal pay, and paid family leave.\n**Civil Rights:** The candidate promises to protect and promote civil rights, including expanding the Elliot-Larsen Civil Rights Act and promoting universal voter access.\n**Veterans:** The candidate promises to improve services for Michigan's veterans, including expanding job training programs, increasing medical care, and providing affordable housing.\n**Opioid Crisis:** The candidate promises to address the opioid crisis by expanding treatment services, increasing access to recovery programs, and holding pharmaceutical companies accountable."
 },
 {
   "Party": "Republican",
   "Name": "Greg Abbott",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Marsha Blackburn",
   "Candidate Description": "**National Defense**: Marsha believes in a strong national defense and has supported a 2.6% pay raise for troops, ensuring they have the resources they need to keep America safe.\n**Veterans**: Marsha is committed to improving the welfare and quality of life for veterans, their families, and active-duty military, and has been endorsed by over 1,000 Tennessee veterans.\n**Taxes**: Marsha led the fight against the state income tax and voted for President Trump's tax reform package, aiming to make the tax code simple, fair, low, and permanent.\n**Economy**: Marsha supports job creation through reduced regulations, free markets, and controlled government spending, and has fought to cut taxes and promote economic growth.\n**Supreme Court**: Marsha will vote to confirm strict constitutionalist nominees to the Supreme Court and federal benches, upholding the Constitution and not legislating from the bench.\n**Opioid Epidemic**: Marsha is committed to addressing the opioid crisis through increased funding for prevention, enforcement, treatment, and recovery programs, and has introduced legislation to strengthen the federal response.\n**Border Security**: Marsha believes in securing the border through a combination of physical barriers, technology, and enforcement, and supports deporting illegal immigrants who commit crimes.\n**Free Trade**: Marsha supports free trade and has expressed concerns about retaliatory tariffs, aiming to promote trade that is both free and fair.\n**Human Trafficking**: Marsha has been a leader in the fight against human trafficking, working to shut down websites that facilitate sex trafficking and increase penalties for perpetrators.\n**Government Spending**: Marsha believes in reducing government spending and cutting taxes to balance the budget and protect national security.\n**Infrastructure**: Marsha supports rebuilding the nation's infrastructure, including roads, highways, and broadband access, and has led efforts to bring broadband to rural communities.\n**Healthcare**: Marsha is committed to returning healthcare to a patient-centered system, opposing government-controlled healthcare and supporting patient choice and affordability.\n**Education**: Marsha believes in applying conservative, common-sense approaches to education, including expanding school choice, increasing charter school options, and supporting state and local control of education.\n**President Trump**: Marsha will stand with President Trump and work with him to implement his agenda, including draining the swamp, protecting national security, and building the wall.\n**Law and Order**: Marsha supports law enforcement and will work to ensure they have the necessary resources to keep Tennesseans safe.      \n**Pro-Life**: Marsha is 100% pro-life and has been a leader in the fight against abortion, chairing a House panel that investigated the sale of baby body parts and resulting in 15 criminal referrals."
 },
 {
   "Party": "Republican",
   "Name": "Katie Britt",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Doug Burgum",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Ben Carson",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Ron DeSantis",
   "Candidate Description": "**Economic Policy:** Opposes tax increases and supports a constitutional amendment requiring a supermajority vote to raise taxes. Aims to reduce bureaucracy, eliminate unreasonable regulations, and crack down on lawsuit abuse.\n**Education:** Opposes Common Core and prioritizes American civics and Constitutional study. Advocates for skills-based education, vocational training, and enhanced parental choice programs for a high-quality education.\n**Immigration:** Supports E-verify to ensure a legal workforce and higher wages for Floridians. Opposes sanctuary cities in Florida.\n**Environmental Policy:** Aims to protect coasts by stopping toxic discharges and storing/cleaning polluted water. Supports beach restoration, flood mitigation, and Everglades restoration.\n**Judicial Appointments:** Supports the appointment of constitutional conservatives to the Florida Supreme Court.\n**Social Policy:** Defends the right to life by signing pro-life legislation into law. Defends Second Amendment rights for law-abiding Floridians. Defends First Amendment speech rights against attempts to silence conservatives."
 },
 {
   "Party": "Republican",
   "Name": "Byron Donalds",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Tulsi Gabbard",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Marjorie Taylor Greene",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Kari Lake",
   "Candidate Description": "**Key Points:**1. Securing the border and elections\n2. Locating a new source of fresh water\n3. Reducing inflation and housing costs\n4. Improving education, with a focus on technical education\n5. Creating smart economic growth\n6. Addressing the homelessness crisis\n7. Ensuring businesses, churches, and gyms remain open\n8. Reducing crime rates and increasing public safety"
 },
 {
   "Party": "Republican",
   "Name": "Nancy Mace",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Kristi Noem",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Mike Pompeo",
   "Candidate Description": "**Immigration**: The candidate emphasizes the importance of enforcing current immigration laws to prevent illegal immigration, increasing border security, and prioritizing national security.\n**Healthcare**: The candidate voted to repeal Obamacare and advocates for a healthcare system guided by the needs of doctors and patients, rather than insurers, the federal government, or bureaucracy.\n**Job Growth**: The candidate has fought for private sector job growth by reducing regulations, promoting entrepreneurship, and supporting small business owners.\n**National Defense**: The candidate prioritizes strong national defense, addressing threats from countries like Iran and North Korea, and supporting allies like Israel.\n**Taxes**: The candidate has consistently opposed tax increases, believing that lowering the tax burden on families and businesses is essential for economic growth and job creation."
 },
 {
   "Party": "Republican",
   "Name": "Vivek Ramaswamy",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Kim Reynolds",
   "Candidate Description": "The candidate is a strong advocate for enforcing current immigration laws, increasing border security, and prioritizing national security. They have a track record of supporting private sector job growth by reducing regulations and promoting entrepreneurship. On healthcare, they voted to repeal Obamacare and aim to create a system guided by doctors and patients, rather than insurers or bureaucracy. They prioritize strong national defense, addressing threats from countries like Iran and North Korea, and supporting allies like Israel. Additionally, they are a vocal opponent of tax increases, believing that reducing the tax burden is essential for economic growth and job creation."
 },
 {
   "Party": "Republican",
   "Name": "Marco Rubio",
   "Candidate Description": "* Strong Families: The candidate believes that strong families are the foundation of American greatness and that Washington's policies have weakened families and institutions that support them.\n* Education: The candidate opposes the Common Core initiative, which they see as an effort to create a national school board and believes that states should have more control over education.\n* Jobs and Economy: The candidate has worked to help Florida businesses compete in the global economy by reducing taxes and regulations, and believes that this approach will create jobs and increase wages.\n* Energy: The candidate supports harnessing America's abundant energy resources to make energy affordable, create jobs, protect the environment, and strengthen national security.\n* National Security: The candidate is concerned about the threat of terrorism, particularly from ISIS, and believes that the US must take a strong stance to protect its citizens and national security."
 },
 {
   "Party": "Republican",
   "Name": "Tim Scott",
   "Candidate Description": "* Advocates for reducing government interference to allow small businesses to thrive\n* Supports common sense reforms in healthcare to increase competition and choice\n* Committed to decreasing dependence on foreign energy sources\n* Prioritizes creating good-paying jobs, national security, and lowering gas prices"
 },
 {
   "Party": "Republican",
   "Name": "Sarah Huckabee Sanders",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Elise Stefanik",
   "Candidate Description": "Economy: Create jobs and economic opportunities for small businesses to grow in Upstate New York.\nRegulatory & Tax Reform: Reduce the out-of-control tax and regulatory burdens facing small businesses by reforming the tax code to be flatter and fairer.\nHealthcare: Repeal Obamacare and replace it with common sense solutions to lower health care costs and improve quality and access.\nFiscal Responsibility: Fight for fiscal responsibility by balancing the budget and protecting and preserving entitlements.\nAgriculture: Support Upstate farmers – the backbone of our North Country communities"
 },
 {
   "Party": "Republican",
   "Name": "J.D. Vance",
   "Candidate Description": "No Description Found"
 },
 {
   "Party": "Republican",
   "Name": "Glenn Youngkin",
   "Candidate Description": "* Rebuilding Virginia's economy to lower the cost of living for all residents.\n* Commitment to not raising taxes.\n* Reducing regulatory burdens for small businesses.\n* Improving education for children, focusing on affordability.\n* Protecting Constitutional rights."
 }
]