[
 {
   "Party": "Republican",
   "Name": "Donald Trump",
   "Description": "Description Not Found"
 },
 {
   "Party": "Democratic",
   "Name": "Kamala Harris",
   "Description": "**Civil Rights:** Supports a woman's right to choose, equal pay for equal work, and comprehensive immigration reform. Will lead the charge against LGBT discrimination and focus on fixing the criminal justice system.\n **Criminal Justice Reform:** Advocates for a \"smart on crime\" approach that applies innovative, data-driven methods to reduce violence and recidivism, while maintaining a focus on aggressively prosecuting violent criminals.\n **Environment:** Recognizes California's environmental diversity and believes in protecting and preserving its natural beauty.\n **Foreign Policy:** Takes a vigilant approach to foreign policy, having tackled human trafficking and transnational criminal organizations. Prioritizes addressing global threats.\n **Higher Education:** Believes that access to education is a pathway to the American dream and advocates for making postsecondary education a necessity for securing sustainable employment."
 },
 {
   "Party": "Green",
   "Name": "Jill Stein",
   "Description": "Description Not Found"
 },
 {
   "Party": "Independent",
   "Name": "Robert F Kennedy",
   "Description": "Description Not Found"
 },
 {
   "Party": "Liberals",
   "Name": "Chase Oliver",
   "Description": "Foreign policy (I'm antiwar), criminal justice reform and immigration reform."
 },
 {
   "Party": "Socialism",
   "Name": "Claudia De La Cruz",
   "Description": "Transforming the economy from a capitalist model to a socialist one will be the first step in addressing a range of issues that plague our country and world. It is through a socialist program that we will be able to begin to tackle racism, imperialism, climate change, police violence, the bloated military budget, attacks on the rights of women and LGBTQ+ people, and the pursuit of profit that prevents our government from implementing the social programs that working class people desperately need."
 },
 {
   "Party": "Independent",
   "Name": "Cornel West",
   "Description": "Black Maternal Justice, Child Justice, Disability Justice, Economic Justice, Education Justice, Elder Justice, Environmental Justice, Gender Justice, Global Justice, Gun Violence Justice, Health Justice, Immigration Justice, LGBTQIA+ Justice, Racial Justice, Transformative Justice, Voter Justice, Worker Justice"
 },
 {
   "Party": "American Solidarity",
   "Name": "Peter Sonski",
   "Description": "Description Not Found"
 },
 {
   "Party": "Constitution",
   "Name": "Randall Terry",
   "Description": "Description Not Found"
 },
 {
   "Party": "Independent",
   "Name": "Shiva Ayyadurai",
   "Description": "Description Not Found"
 },
 {
   "Party": "Independent",
   "Name": "Richard Duncan",
   "Description": "Description Not Found"
 },
 {
   "Party": "Constitution",
   "Name": "Joel Skousen ",
   "Description": "Description Not Found"
 },
 {
   "Party": "Independent",
   "Name": "Jay Bowman",
   "Description": "Our two party politicians do not know how to say no to deficit spending. I understand why, it is a difficult topic. We need to address now for our children. Vote NO, stop spending money we don't have."
 },
 {
   "Party": "Independent",
   "Name": "Cristopher Garrity",
   "Description": "Description Not Found"
 },
 {
   "Party": "Socialist Equality",
   "Name": "Joseph Kishore",
   "Description": "Description Not Found"
 },
 {
   "Party": "Socialist Workers",
   "Name": "Rachele Fruit",
   "Description": "Description Not Found"
 },
 {
   "Party": "Godliness, Truth, Justice",
   "Name": "Mattie Preston",
   "Description": "Description Not Found"
 },
 {
   "Party": "Unaffiliated",
   "Name": "Lucifer Everylove",
   "Description": "Description Not Found"
 },
 {
   "Party": "Approval Voting",
   "Name": "Blake Huber",
   "Description": "**Top Priorities:**\n* Conducting studies on alternative voting methods, including Approval Voting and Ranked Choice Voting\n*Personal Passions:**\n* Improving the voting process to ensure honest and sincere voting\n**Role Models:**\n* Thomas Jefferson, known for his intelligence and caring nature\n**Recommended Reading:**\n* \"Gaming the Vote\" by William Poundstone, to understand the limitations of the current voting system\n**Important Qualities:**\n* Honesty and transparency in decision-making\n**Core Responsibilities:**\nListening to the voters and representing their interests\n**Legacy:** Implementing an alternative voting method, such as Approval Voting or Ranked Choice Voting, across the state of Colorado\n**Key Focus:** Improving the voting process to ensure voters can truly express themselves and be represented by candidates with broad popular support    \n**Skills:** Effective communication and management skills, with the ability to bring people togethe"
 },
 {
   "Party": "Prohibition",
   "Name": "Michael Wood",
   "Description": "Description Not Found"
 },
 {
   "Party": "Independent",
   "Name": "Vermin Supreme",
   "Description": "Description Not Found"
 },
 {
   "Party": "Liberal ",
   "Name": "Laura Ebke",
   "Description": "**Gun Rights**: The candidate strongly opposes further regulations on the right to keep and bear arms, and would vote against registration or regulation, considering even current regulations unnecessary.\n**Protecting Life**: The candidate is unequivocally Pro-Life, meaning they believe in preserving the right to life of unborn individuals.   \n**Education**: The candidate believes in local control of education, with school boards making decisions for their students, given well-defined goals and collaboration with teachers, administrators, and parents.\n**Taxes and Spending**: The candidate advocates for a limited government with maximum authority in the hands of individuals, aiming to reduce government intervention and cut taxes by shifting responsibilities to citizens and private groups."
 },
 {
   "Party": "Socialist",
   "Name": "William P Stodden",
   "Description": "Description Not Found"
 },
 {
   "Party": "Independent",
   "Name": "Robert Wells",
   "Description": "**Economic Policy**: Robby Wells aims to reduce inflation and lower costs for everyday Americans by keeping more tax dollars at home.\n**Border Security**: Wells proposes doubling the border patrol without raising taxes and creating a pathway to citizenship for those who come to the US legally.\n**Gun Violence**: Robby supports the Second Amendment and proposes the \"Vets for Kids\" plan, which would employ veterans as guardians in schools to prevent gun violence.\n**Bipartisanship**: Wells promises to work in a bipartisan manner, using his \"Eaglenomics\" plan to bring together ideas from both major political parties.\n**Term Limits**: Robby will propose legislation to impose term limits on federal office holders and has pledged to serve in the U.S. House for only two terms (four years) if elected."
 }
]